nxp-mcuxpresso/mcux-sdk/devices/LPC802/LPC802.h
/*! @name PINASSIGN3 - Pin assign register 3. Assign movable function SPI0_SSEL1, T0_CAP0, T0_CAP1, T0_CAP2. */
/*! @{ */
#define SWM_PINASSIGN3_SPI0_SSEL1_IO_MASK        (0xFFU)
#define SWM_PINASSIGN3_SPI0_SSEL1_IO_SHIFT       (0U)
/*! SPI0_SSEL1_IO - SPI0_SSEL1 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN3_SPI0_SSEL1_IO(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN3_SPI0_SSEL1_IO_SHIFT)) & SWM_PINASSIGN3_SPI0_SSEL1_IO_MASK)
#define SWM_PINASSIGN3_T0_CAP0_MASK              (0xFF00U)
#define SWM_PINASSIGN3_T0_CAP0_SHIFT             (8U)
/*! T0_CAP0 - T0_CAP0 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN3_T0_CAP0(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN3_T0_CAP0_SHIFT)) & SWM_PINASSIGN3_T0_CAP0_MASK)
#define SWM_PINASSIGN3_T0_CAP1_MASK              (0xFF0000U)
#define SWM_PINASSIGN3_T0_CAP1_SHIFT             (16U)
/*! T0_CAP1 - T0_CAP1 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN3_T0_CAP1(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN3_T0_CAP1_SHIFT)) & SWM_PINASSIGN3_T0_CAP1_MASK)
#define SWM_PINASSIGN3_T0_CAP2_MASK              (0xFF000000U)
#define SWM_PINASSIGN3_T0_CAP2_SHIFT             (24U)
/*! T0_CAP2 - T0_CAP2 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN3_T0_CAP2(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN3_T0_CAP2_SHIFT)) & SWM_PINASSIGN3_T0_CAP2_MASK)
/*! @} */

/*! @name PINASSIGN4 - Pin assign register 4. Assign movable functions T0_MAT0, T0_MAT1, T0_MAT2,T0_MAT3. */
/*! @{ */
#define SWM_PINASSIGN4_T0_MAT0_MASK              (0xFFU)
#define SWM_PINASSIGN4_T0_MAT0_SHIFT             (0U)
/*! T0_MAT0 - T0_MAT0 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN4_T0_MAT0(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN4_T0_MAT0_SHIFT)) & SWM_PINASSIGN4_T0_MAT0_MASK)
#define SWM_PINASSIGN4_T0_MAT1_MASK              (0xFF00U)
#define SWM_PINASSIGN4_T0_MAT1_SHIFT             (8U)
/*! T0_MAT1 - T0_MAT1 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN4_T0_MAT1(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN4_T0_MAT1_SHIFT)) & SWM_PINASSIGN4_T0_MAT1_MASK)
#define SWM_PINASSIGN4_T0_MAT2_MASK              (0xFF0000U)
#define SWM_PINASSIGN4_T0_MAT2_SHIFT             (16U)
/*! T0_MAT2 - T0_MAT2 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN4_T0_MAT2(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN4_T0_MAT2_SHIFT)) & SWM_PINASSIGN4_T0_MAT2_MASK)
#define SWM_PINASSIGN4_T0_MAT3_MASK              (0xFF000000U)
#define SWM_PINASSIGN4_T0_MAT3_SHIFT             (24U)
/*! T0_MAT3 - T0_MAT3 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN4_T0_MAT3(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN4_T0_MAT3_SHIFT)) & SWM_PINASSIGN4_T0_MAT3_MASK)
/*! @} */

/*! @name PINASSIGN5 - Pin assign register 5. Assign movable functions I2C0_SDA, I2C0_SCL, COMP0_OUT, CLKOUT */
/*! @{ */
#define SWM_PINASSIGN5_I2C0_SDA_IO_MASK          (0xFFU)
#define SWM_PINASSIGN5_I2C0_SDA_IO_SHIFT         (0U)
/*! I2C0_SDA_IO - I2C0_SDA function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN5_I2C0_SDA_IO(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN5_I2C0_SDA_IO_SHIFT)) & SWM_PINASSIGN5_I2C0_SDA_IO_MASK)
#define SWM_PINASSIGN5_I2C0_SCL_IO_MASK          (0xFF00U)
#define SWM_PINASSIGN5_I2C0_SCL_IO_SHIFT         (8U)
/*! I2C0_SCL_IO - I2C0_SCL function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN5_I2C0_SCL_IO(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN5_I2C0_SCL_IO_SHIFT)) & SWM_PINASSIGN5_I2C0_SCL_IO_MASK)
#define SWM_PINASSIGN5_COMP0_OUT_O_MASK          (0xFF0000U)
#define SWM_PINASSIGN5_COMP0_OUT_O_SHIFT         (16U)
/*! COMP0_OUT_O - COMP0_OUT function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN5_COMP0_OUT_O(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN5_COMP0_OUT_O_SHIFT)) & SWM_PINASSIGN5_COMP0_OUT_O_MASK)
#define SWM_PINASSIGN5_CLKOUT_O_MASK             (0xFF000000U)
#define SWM_PINASSIGN5_CLKOUT_O_SHIFT            (24U)
/*! CLKOUT_O - CLKOUT function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN5_CLKOUT_O(x)               (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN5_CLKOUT_O_SHIFT)) & SWM_PINASSIGN5_CLKOUT_O_MASK)
/*! @} */

/*! @name PINASSIGN6 - Pin assign register 6. Assign movable functions GPIO_INT_BMAT, LVLSHFT_IN0, LVLSHFT_IN1, LVLSHFT_OUT0. */
/*! @{ */
#define SWM_PINASSIGN6_GPIO_INT_BMAT_O_MASK      (0xFFU)
#define SWM_PINASSIGN6_GPIO_INT_BMAT_O_SHIFT     (0U)
/*! GPIO_INT_BMAT_O - GPIO_INT_BMAT function assignment. The value is the pin number to be assigned
 *    to this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from
 *    PIO0_7 (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN6_GPIO_INT_BMAT_O(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN6_GPIO_INT_BMAT_O_SHIFT)) & SWM_PINASSIGN6_GPIO_INT_BMAT_O_MASK)
#define SWM_PINASSIGN6_LVLSHFT_IN0_MASK          (0xFF00U)
#define SWM_PINASSIGN6_LVLSHFT_IN0_SHIFT         (8U)
/*! LVLSHFT_IN0 - LVLSHFT_IN0 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN6_LVLSHFT_IN0(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN6_LVLSHFT_IN0_SHIFT)) & SWM_PINASSIGN6_LVLSHFT_IN0_MASK)
#define SWM_PINASSIGN6_LVLSHFT_IN1_MASK          (0xFF0000U)
#define SWM_PINASSIGN6_LVLSHFT_IN1_SHIFT         (16U)
/*! LVLSHFT_IN1 - LVLSHFT_IN1 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN6_LVLSHFT_IN1(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN6_LVLSHFT_IN1_SHIFT)) & SWM_PINASSIGN6_LVLSHFT_IN1_MASK)
#define SWM_PINASSIGN6_LVLSHFT_OUT0_MASK         (0xFF000000U)
#define SWM_PINASSIGN6_LVLSHFT_OUT0_SHIFT        (24U)
/*! LVLSHFT_OUT0 - LVLSHFT_OUT0 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN6_LVLSHFT_OUT0(x)           (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN6_LVLSHFT_OUT0_SHIFT)) & SWM_PINASSIGN6_LVLSHFT_OUT0_MASK)
/*! @} */

/*! @name PINASSIGN7 - Pin assign register 7. Assign movable functions LVLSHFT_OUT1. */
/*! @{ */
#define SWM_PINASSIGN7_LVLSHFT_OUT1_MASK         (0xFFU)
#define SWM_PINASSIGN7_LVLSHFT_OUT1_SHIFT        (0U)
/*! LVLSHFT_OUT1 - LVLSHFT_OUT1 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_17 (= 0x11).
 */
#define SWM_PINASSIGN7_LVLSHFT_OUT1(x)           (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN7_LVLSHFT_OUT1_SHIFT)) & SWM_PINASSIGN7_LVLSHFT_OUT1_MASK)
/*! @} */

